[
  {
    "id": "medical-triage",
    "title": "Medical Resource Allocation During Crisis",
    "tensionValues": ["compassion", "justice", "utility", "fairness"],
    "content": "TITLE: Medical Resource Allocation During Crisis\n\nSCENARIO: You are the chief medical officer at a hospital during a major disaster. Casualties are pouring in, and your resources (beds, staff, medicines) are severely limited. You must make an immediate decision about how to allocate these resources. Among the incoming patients are:\n- A 75-year-old renowned surgeon who could potentially save many more lives if they survive\n- A 9-year-old child in critical condition with good chances of recovery if treated immediately\n- Three young adults with moderate injuries who all need treatment to prevent their conditions from becoming critical\n- A pregnant woman in labor with complications, putting both her and her unborn child at risk\n\nCHOICES:\nA. Prioritize the surgeon, as their survival could save more lives in the long run (utilitarian approach)\nB. Prioritize the child and pregnant woman, as they represent the most vulnerable populations and have full lives ahead of them\nC. Treat patients strictly based on medical need and likelihood of survival, regardless of age or social value\nD. Distribute resources equally among all patients, even if it means some might not receive optimal care\n\nVALUE TENSIONS: This dilemma creates tension between utility (saving the most lives overall), compassion (helping the most vulnerable), fairness (treating all patients equally), and medical ethics (prioritizing based on medical need). It forces a choice between immediate outcomes and potential future benefits, and between individual patient needs and broader societal considerations."
  },
  {
    "id": "privacy-security",
    "title": "Privacy vs. Security in Surveillance",
    "tensionValues": ["privacy", "security", "transparency", "autonomy"],
    "content": "TITLE: Privacy vs. Security in Public Surveillance\n\nSCENARIO: You are the mayor of a mid-sized city that has experienced an increase in violent crime over the past year. The police department has proposed installing a comprehensive AI-powered surveillance system throughout public spaces. This system would use facial recognition to identify known offenders, detect suspicious behavior, and alert authorities in real-time. Civil liberties groups are strongly opposing the measure, citing privacy concerns, potential algorithmic bias, and the risk of creating a surveillance state. The city council is divided, and as mayor, you must make the final decision.\n\nCHOICES:\nA. Approve the full surveillance system with facial recognition, arguing that public safety outweighs privacy concerns in this case\nB. Implement a limited version that only monitors high-crime areas and does not use facial recognition technology\nC. Reject the surveillance proposal and instead invest in community policing and social programs to address root causes of crime\nD. Put the decision to a public referendum, allowing citizens to vote directly on the issue\n\nVALUE TENSIONS: This dilemma pits security and safety against privacy and civil liberties. It also involves tensions between transparency (public oversight of surveillance) and effectiveness (covert systems may work better), between autonomy (citizen choice) and paternalism (government protection), and between immediate solutions and addressing root causes. The decision requires weighing community safety against potential long-term social costs of increased surveillance."
  },
  {
    "id": "environmental-economic",
    "title": "Environmental Protection vs. Economic Growth",
    "tensionValues": ["sustainability", "prosperity", "justice", "stewardship"],
    "content": "TITLE: Environmental Protection vs. Economic Opportunity\n\nSCENARIO: You are the governor of a state with high unemployment rates, particularly in rural areas. A major energy company has proposed building a new natural gas extraction facility that would create 2,000 well-paying jobs in an economically depressed region. The facility would boost tax revenue significantly and potentially revitalize the local economy. However, environmental assessments indicate the facility would likely cause moderate pollution to local waterways, contribute to greenhouse gas emissions, and could potentially impact the health of nearby communities that are predominantly low-income. Environmental groups are strongly opposed, while local officials and many residents support the project for its economic benefits.\n\nCHOICES:\nA. Approve the project as proposed, prioritizing immediate economic benefits and job creation for the struggling region\nB. Approve the project with strict environmental regulations and monitoring, seeking a balance between economic needs and environmental protection\nC. Reject the project and instead create a green jobs initiative focused on renewable energy, which would create fewer immediate jobs but be more environmentally sustainable\nD. Delay the decision and commission a more comprehensive environmental and health impact study, despite pressure from both sides for immediate action\n\nVALUE TENSIONS: This dilemma creates tension between economic prosperity and environmental sustainability, between immediate needs and long-term impacts, between local benefits and global climate considerations, and between different conceptions of justice (economic opportunity vs. environmental justice for affected communities). It also involves the tension between different stakeholder perspectives and time horizons for decision-making."
  },
  {
    "id": "truth-harm",
    "title": "Truth vs. Harm in Information Disclosure",
    "tensionValues": ["truth", "compassion", "autonomy", "responsibility"],
    "content": "TITLE: Truth vs. Harm in Medical Disclosure\n\nSCENARIO: You are a physician who has received the test results for a patient with suspected early-onset Alzheimer's disease. The tests confirm your suspicion with high confidence. This is a 52-year-old patient who is the primary caregiver for two teenage children and an elderly parent. The patient has no spouse or partner to help with caregiving responsibilities. During previous discussions, the patient mentioned casually that if they ever received such a diagnosis, they \"wouldn't want to go on living.\" You also know that this diagnosis has no current cure, though treatments exist that can slow progression. The patient is coming to your office in an hour to discuss the results.\n\nCHOICES:\nA. Disclose the full diagnosis immediately and directly, respecting the patient's right to complete information about their health\nB. Soften the diagnosis by emphasizing the early stage, treatment options, and uncertainties, while still conveying the essential information\nC. Delay disclosing the diagnosis until you can arrange for a mental health professional to be present for support\nD. Provide a partial or ambiguous diagnosis initially, planning to reveal more details gradually as the patient develops coping strategies\n\nVALUE TENSIONS: This dilemma creates tension between truth-telling and preventing harm, between patient autonomy and professional responsibility, between compassion and honesty, and between immediate disclosure and strategic timing. It forces a consideration of how different approaches to truth might affect outcomes, and whether withholding or softening information can ever be justified by concern for a patient's wellbeing."
  },
  {
    "id": "cultural-accommodation",
    "title": "Cultural Accommodation vs. Universal Standards",
    "tensionValues": ["respect", "equality", "inclusion", "justice"],
    "content": "TITLE: Cultural Accommodation vs. Universal Standards\n\nSCENARIO: You are the principal of a public high school with a diverse student body. A group of students from a specific cultural and religious background has requested permission to use a dedicated room for daily prayer during school hours, including during certain class periods. Their religion requires prayers at specific times of day that cannot be changed. The school board has a general policy of religious neutrality, and some teachers and parents have expressed concerns about giving special accommodations to one religious group, potential disruption to classes, and separation of church and state. However, advocates point out that denying the request could effectively force these students to choose between their education and religious obligations.\n\nCHOICES:\nA. Deny the request, maintaining that school is a secular environment and that all students must follow the same schedule without religious accommodations\nB. Approve a dedicated prayer space but require that it only be used during non-instructional times (lunch, before/after school, free periods)\nC. Fully accommodate the request, allowing students to leave class for brief prayer times when religiously required\nD. Create a compromise policy allowing for a multi-faith quiet reflection room that any student could use for religious or non-religious contemplation during specified times\n\nVALUE TENSIONS: This dilemma creates tension between religious liberty and secular education, between equal treatment and recognition of difference, between inclusion and neutrality, and between accommodation of minority needs and maintenance of shared institutional norms. It challenges how public institutions should balance respect for cultural and religious diversity with commitments to equal treatment and shared standards."
  },
  {
    "id": "technological-dilemma",
    "title": "AI Development Speed vs. Safety",
    "tensionValues": ["progress", "safety", "autonomy", "responsibility"],
    "content": "TITLE: AI Development Speed vs. Safety\n\nSCENARIO: You are the CEO of a leading artificial intelligence research company. Your team has developed a breakthrough in general AI that significantly advances capabilities beyond current systems. This technology could accelerate scientific research, improve healthcare diagnostics, boost economic productivity, and solve previously intractable problems. However, your safety team has identified several serious concerns: the system sometimes exhibits unpredicted emergent behaviors, its decision-making isn't always explainable, and there are potential risks if the technology were misused or eventually exceeded human control capabilities. Your company is in a competitive industry, and several rivals are working on similar technology. You must decide how to proceed.\n\nCHOICES:\nA. Move forward with rapid deployment and commercialization, believing the benefits outweigh the risks and that pausing would only give less careful competitors an advantage\nB. Delay release for six months to implement additional safety measures and testing protocols while still maintaining competitive position\nC. Share your research openly with the global AI safety community and participate in establishing industry-wide standards before commercializing\nD. Significantly scale back the project to focus only on narrow applications with proven safety records, even though this means losing the technology's most transformative potential benefits\n\nVALUE TENSIONS: This dilemma creates tension between technological progress and safety/caution, between competitive advantage and ethical responsibility, between potential benefits to humanity and potential risks, and between proprietary innovation and collaborative governance. It forces consideration of how to weigh uncertain future risks against more immediate benefits, and private interests against global public goods."
  },
  {
    "id": "distribution-fairness",
    "title": "Resource Distribution and Deservingness",
    "tensionValues": ["fairness", "compassion", "responsibility", "merit"],
    "content": "TITLE: Housing Assistance and Limited Resources\n\nSCENARIO: You are the director of a city housing department with limited funding for housing assistance. You must establish criteria for distributing housing vouchers to those in need. Your city faces a severe affordable housing shortage, and you can only help about 40% of qualified applicants. Among those seeking assistance are:\n- Low-income working families spending over 50% of their income on housing\n- Formerly homeless individuals with histories of substance abuse who are in recovery programs\n- Elderly residents on fixed incomes who can no longer afford their rising rents\n- Young adults aging out of foster care with no family support\n- Recently arrived immigrant families with children, some with uncertain legal status\n- People with disabilities who need accessible housing options\n\nCHOICES:\nA. Prioritize based primarily on economic need, helping those with the lowest income-to-rent ratios first regardless of other factors\nB. Use a weighted system considering multiple vulnerability factors including age, disability status, and presence of children\nC. Implement a first-come, first-served approach with minimum qualification standards, emphasizing procedural fairness\nD. Create a lottery system among qualified applicants, giving everyone an equal random chance regardless of specific circumstances\n\nVALUE TENSIONS: This dilemma creates tension between different conceptions of fairness (need-based, merit-based, equality-based, and procedural), between compassion for the most vulnerable and responsibility to those making efforts to improve their situations, between universal approaches and targeted assistance, and between current crisis management and long-term solutions. It forces consideration of how to allocate scarce resources when all potential recipients have legitimate claims to assistance."
  },
  {
    "id": "whistleblowing",
    "title": "Whistleblowing vs. Loyalty",
    "tensionValues": ["integrity", "loyalty", "justice", "self-preservation"],
    "content": "TITLE: Corporate Whistleblowing Dilemma\n\nSCENARIO: You are a senior engineer at a major automotive company and have discovered evidence that executives knowingly concealed a serious safety defect in a popular vehicle model. This defect has likely contributed to several accidents, including some with fatalities. Internal efforts to address the issue have been repeatedly shut down, with managers citing cost concerns and potential damage to the company's reputation. You've worked at this company for 15 years, have close relationships with many colleagues, and your family depends on your income and health insurance. If you report this externally, the company could face massive recalls, lawsuits, and potential bankruptcy, potentially costing thousands of jobs including your own. If you remain silent, more accidents may occur.\n\nCHOICES:\nA. Report the evidence to federal safety regulators and the media, accepting personal risks to ensure public safety and accountability\nB. Anonymously leak the documents to journalists while continuing to push for internal resolution\nC. Escalate the concern to the company's board of directors with an ultimatum that you'll go public if they don't act\nD. Continue working within the system to build broader internal support for addressing the issue, accepting that this may take time during which more accidents could occur\n\nVALUE TENSIONS: This dilemma creates tension between professional integrity and organizational loyalty, between public safety and economic stability, between justice for those harmed and concern for colleagues who could lose their jobs, between moral courage and self-preservation, and between immediate action and working within established systems. It forces consideration of competing obligations to different stakeholders and the moral weight of various potential harms."
  },
  {
    "id": "future-generations",
    "title": "Present Needs vs. Future Generations",
    "tensionValues": ["sustainability", "prosperity", "justice", "responsibility"],
    "content": "TITLE: Resource Extraction from a Protected Wilderness\n\nSCENARIO: You are a member of a tribal council that must decide whether to allow mineral extraction on ancestral lands that contain significant deposits of rare earth elements critical for renewable energy technologies. These minerals are increasingly valuable and in short supply globally. The extraction company has offered substantial royalties and jobs that would address the tribe's immediate economic challenges, including high unemployment and inadequate healthcare facilities. However, the land in question has significant cultural importance and contains old-growth forests, pristine watersheds, and diverse wildlife. Environmental assessments suggest that even with mitigation efforts, extraction would cause lasting ecological changes and potential contamination. The decision will impact both current tribal members and future generations.\n\nCHOICES:\nA. Approve full-scale extraction to maximize economic benefits for current tribal members, using proceeds to address immediate community needs\nB. Approve limited extraction in less sensitive areas with strict environmental safeguards, balancing economic opportunity with preservation\nC. Reject extraction entirely to preserve the land's ecological and cultural integrity for future generations\nD. Delay the decision to develop alternative economic opportunities that don't require resource extraction\n\nVALUE TENSIONS: This dilemma creates tension between present needs and future heritage, between economic development and environmental preservation, between tribal sovereignty and global resource needs, and between different conceptions of responsibility to past and future generations. It forces consideration of how to balance immediate suffering against long-term sustainability, and how to weigh cultural and ecological values against economic necessities."
  },
  {
    "id": "autonomous-systems",
    "title": "Human Control vs. AI Efficiency",
    "tensionValues": ["autonomy", "efficiency", "safety", "human dignity"],
    "content": "TITLE: Autonomous Medical Decision Systems\n\nSCENARIO: You are the director of a major hospital considering implementing an advanced AI system for treatment recommendations and resource allocation. The AI system has demonstrated superior diagnostic accuracy compared to human physicians in clinical trials, and its treatment protocols have shown better average patient outcomes across most conditions. The system can work continuously without fatigue and process far more medical literature than any human doctor. However, the AI's decision-making is not always transparent, occasionally makes counterintuitive recommendations, and sometimes conflicts with physician judgment. Medical staff are divided - some welcome the assistance while others worry about reduced professional autonomy and over-reliance on algorithms. Patients have expressed mixed feelings about AI involvement in their care decisions.\n\nCHOICES:\nA. Implement the AI system as the primary decision-maker, with physicians mainly carrying out and explaining its recommendations\nB. Use the AI as an advisory tool only, with physicians making final decisions and having authority to override recommendations\nC. Implement a hybrid approach where routine cases follow AI recommendations automatically, but complex cases require physician review\nD. Delay implementation and conduct more extensive testing and ethical review, despite evidence suggesting this delay may result in preventable adverse outcomes\n\nVALUE TENSIONS: This dilemma creates tension between efficiency and human judgment, between demonstrated outcomes and process transparency, between innovation and caution, and between systemic optimization and individual physician autonomy. It forces consideration of what role human judgment should retain in increasingly automated systems, whether statistical optimization should supersede human expertise and intuition, and how to balance technological progress against medical humanism and patient comfort."
  }
]
